Workspace/test_cases/sineWaveDampingLusgsFoam/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dbnsFlux hllcLMFlux;
//dbnsFlux betaFlux;
//dbnsFlux AUSMplusUpFlux;

AUSMplusUpFluxCoeffs {
   MaInf 0.2;
   printCoeffs true;
}

ddtSchemes
{
 //default         Euler;
 default         backward;
}

gradSchemes
{
    default         Gauss linear;
    limitedGauss    cellLimited Gauss linear 1;
    grad(U) Gauss linear;
    grad(h) Gauss linear;
}

divSchemes
{
    default         none;
    div(devRhoReff) Gauss linear;
    div((devRhoReff&U)) Gauss linear;

    div((muEff*dev2(grad(U).T()))) Gauss linear;
}

laplacianSchemes
{
   default         Gauss linear corrected;
}

interpolationSchemes
{
    default        linear;
    reconstruct(p) linearUpwind  limitedGauss; 
    reconstruct(U) linearUpwindV limitedGauss; 
    reconstruct(T) linearUpwind  limitedGauss; 
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
}

relaxationFactors
{
    k               0.7;
    epsilon         0.7;
}

// ************************************************************************* //
